# Pandas

In [3]:
import pandas as pd

DataFrame - двумерная матрица

In [4]:
frame = pd.DataFrame({'numbers': range(10), 'chars':['a']*10})

In [5]:
frame

   numbers chars
0        0     a
1        1     a
2        2     a
3        3     a
4        4     a
5        5     a
6        6     a
7        7     a
8        8     a
9        9     a

## Считываение из csv-файла

In [6]:
frame = pd.read_csv("dataset.tsv", header=0, sep="\t")

In [7]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

- Вывод колонок датафрейма

In [8]:
frame.columns

Index(['Name', 'Birth', 'City', 'Position'], dtype='object')

- Измерения датафрейма (количество строк, количество столбцов)

In [9]:
frame.shape

(6, 4)

- Добавление новой строки.   
Происходит без изменения текущего датафрейма, поэтому можно поставить в аргументах inplace=True

In [10]:
new_line = {"Name": "Васильев А. А.", "Birth": "22.03.1944", "City": "Воронеж"}

In [11]:
frame = frame.append(new_line, ignore_index=True)

- Добавление нового столбца

In [12]:
frame["IsStudent"] = [False]*3 + [True]*4

In [13]:
frame

              Name       Birth       City  Position  IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN      False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер      False
2       Белов М.М.  13.02.1980     Ростов  менеджер      False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN       True
4      Рыбина Е.П.  19.11.1985     Москва   инженер       True
5     Костров С.О.  31.05.1985     Москва    стажер       True
6   Васильев А. А.  22.03.1944    Воронеж       NaN       True

- Удаление строк по индексу, обязательно указать ось, по которой удаляем

In [14]:
frame.drop([5, 6], axis=0, inplace=True)

- Удаление столбца

In [15]:
frame.drop("IsStudent", axis=1, inplace=True)

In [16]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер

- Запись в файл. Можно с другими разделителями, заголовками и индексацией

In [17]:
frame.to_csv("updatedDataset.csv", sep=',', header=True, index=False)

In [18]:
!cat updatedDataset.csv

Name,Birth,City,Position
Иванов А.А.,22.03.1980,Москва,
Сорокин И.В.,07.08.1965,Волгоград,инженер
Белов М.М.,13.02.1980,Ростов,менеджер
Мельникова Д.С.,15.04.1985,Ростов,
Рыбина Е.П.,19.11.1985,Москва,инженер

## Индексация и селекция

In [84]:
data = pd.read_csv("data_sample_example.tsv", sep="\t", header=0)

In [85]:
data

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

## Типы значений

In [86]:
data.dtypes

Name        object
Birth       object
City        object
Position    object
dtype: object

## Приведение Birth к DateTime

In [93]:
data.Birth

0    22.03.1980
1    07.08.1965
2    13.02.1980
3    15.04.1985
4    19.11.1985
5    31.05.1985
Name: Birth, dtype: object

In [99]:
from datetime import datetime

In [100]:
data

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [101]:
data.dtypes

Name        object
Birth       object
City        object
Position    object
dtype: object

In [108]:
data.Birth = data.Birth.apply(pd.to_datetime)

## Сводка по датафрейму.
Показывает нулевые колонки, типы, память

In [110]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Birth     6 non-null      datetime64[ns]
 2   City      6 non-null      object
 3   Position  4 non-null      object
dtypes: datetime64[ns](1), object(3)
memory usage: 320.0+ bytes

## Заполнение пропущенных null-значений

In [111]:
data.fillna("разнорабочий", inplace=True)

In [112]:
data

              Name      Birth       City      Position
0      Иванов А.А. 1980-03-22     Москва  разнорабочий
1     Сорокин И.В. 1965-07-08  Волгоград       инженер
2       Белов М.М. 1980-02-13     Ростов      менеджер
3  Мельникова Д.С. 1985-04-15     Ростов  разнорабочий
4      Рыбина Е.П. 1985-11-19     Москва       инженер
5     Костров С.О. 1985-05-31     Москва        стажер

## Обращение к столбцам - по имени
В таком случае Series, массив

In [64]:
data.Position

0    разнорабочий
1         инженер
2        менеджер
3    разнорабочий
4         инженер
5          стажер
Name: Position, dtype: object

## Через [[]] - получение в виде датафрейма

In [65]:
data[["Position"]]

       Position
0  разнорабочий
1       инженер
2      менеджер
3  разнорабочий
4       инженер
5        стажер

In [66]:
data[["Position", "Name"]]

       Position             Name
0  разнорабочий      Иванов А.А.
1       инженер     Сорокин И.В.
2      менеджер       Белов М.М.
3  разнорабочий  Мельникова Д.С.
4       инженер      Рыбина Е.П.
5        стажер     Костров С.О.

## Вывод строк

### Первые строки - через head()

In [40]:
data.head(3)

           Name                Birth       City      Position
0   Иванов А.А.  1980-03-22 00:00:00     Москва  разнорабочий
1  Сорокин И.В.  1965-07-08 00:00:00  Волгоград       инженер
2    Белов М.М.  1980-02-13 00:00:00     Ростов      менеджер

### Либо через индексы списков

In [41]:
data[0:2]

           Name                Birth       City      Position
0   Иванов А.А.  1980-03-22 00:00:00     Москва  разнорабочий
1  Сорокин И.В.  1965-07-08 00:00:00  Волгоград       инженер

## loc - с помощью названий осей

In [42]:
data.loc[[1,3,5], ["Name", "City"]]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

## Через номер - через iloc

In [44]:
data.iloc[[1,3,5], [0,2]]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

## Фильтрация датасета

In [70]:
data.Birth

0    1980-03-22 00:00:00
1    1965-07-08 00:00:00
2    1980-02-13 00:00:00
3    1985-04-15 00:00:00
4    1985-11-19 00:00:00
5           разнорабочий
Name: Birth, dtype: object

In [113]:
data[data.Birth >= datetime(1985,1,1)]

              Name      Birth    City      Position
3  Мельникова Д.С. 1985-04-15  Ростов  разнорабочий
4      Рыбина Е.П. 1985-11-19  Москва       инженер
5     Костров С.О. 1985-05-31  Москва        стажер

## Несколько условий.   
data[(condition) |~& (condition)]

In [115]:
data[(data.Birth >= datetime(1985,1,1)) & (data.City=="Москва")]

           Name      Birth    City Position
4   Рыбина Е.П. 1985-11-19  Москва  инженер
5  Костров С.О. 1985-05-31  Москва   стажер

In [116]:
data[(data.Birth >= datetime(1985,1,1)) | (data.City=="Волгоград")]

              Name      Birth       City      Position
1     Сорокин И.В. 1965-07-08  Волгоград       инженер
3  Мельникова Д.С. 1985-04-15     Ростов  разнорабочий
4      Рыбина Е.П. 1985-11-19     Москва       инженер
5     Костров С.О. 1985-05-31     Москва        стажер